# Last name:  Murzabekov  Name: Almaz  Group: MBD191

# (max 1.5) Part 1. Getting and Knowing your Data

### (max 0.5) Step 1.1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### (max 0.5) Step 1.2. Assign dataset (!!! file chipolte.tsv is  used) to a variable called chipo.

In [2]:
chipo = pd.read_csv("./data/chipotle.tsv", sep = "\t")

In [3]:
chipo.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### (max 0.5) Step 1.3. What was the most ordered item in the choice_description column?

In [4]:
#chipo
#    .groupby("choice_description")
#    .sum()
#    .sort_values(["quantity"], ascending = False)
#    .head(10)

In [5]:
groupped = chipo.groupby("choice_description").sum()
groupped.sort_values(["quantity"], ascending = False).head(1)

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

# (max 2.5) Part 2. Filtering and Sorting Data

### (max 0.5) Step 2.1. What was the quantity of the most expensive item ordered?

In [6]:
chipo["item_price"] = chipo["item_price"].apply(lambda x: float(x[1:]))

In [8]:
chipo.sort_values(["item_price"], ascending = False).head(1)["quantity"]

3598    15
Name: quantity, dtype: int64

### (max 0.5) Step 2.2. How many times were a Veggie Salad Bowl ordered?

In [19]:
chipo[chipo.item_name == "Veggie Salad Bowl"].count()
len(chipo[chipo.item_name == "Veggie Salad Bowl"])

18

### (max 0.5) Step 2.3. Assign new!!! dataset (!!! file Team.csv is  used) to a variable called euro12.

In [20]:
euro12 = pd.read_csv("./data/TEAM.csv")

euro12.head(10)

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,13,81.3%,41,62,2,9,0,9,9,16
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,9,60.1%,53,73,8,7,0,11,11,19
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,10,66.7%,25,38,8,4,0,7,7,15
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,22,88.1%,43,45,6,5,0,11,11,16
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,6,54.6%,36,51,5,6,0,11,11,19
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,13,65.1%,67,48,12,9,1,12,12,20
7,Italy,6,34,45,43.0%,7.5%,110,2,0,0,...,20,74.1%,101,89,16,16,0,18,18,19
8,Netherlands,2,12,36,25.0%,4.1%,60,2,0,0,...,12,70.6%,35,30,3,5,0,7,7,15
9,Poland,2,15,23,39.4%,5.2%,48,0,0,0,...,6,66.7%,48,56,3,7,1,7,7,17

### (max 0.5) Step 2.4. Present only the Shooting Accuracy from England, Italy and Russia

In [24]:
euro12[(euro12.Team == "England") | ( euro12.Team == "Italy") | (euro12.Team == "Russia")][["Team", "Shooting Accuracy"]]

       Team Shooting Accuracy
3   England             50.0%
7     Italy             43.0%
12   Russia             22.5%

### (max 0.5) Step 2.5. Select the teams that start with G

In [25]:
euro12[euro12.Team.str.startswith("G")]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,13,65.1%,67,48,12,9,1,12,12,20

# (max 2.5) Part 3. Grouping

### (max 0.5) Step 3.1. Assign dataset (!!! file drinks.csv is  used) to a variable called drinks.

In [27]:
drinks = pd.read_csv("./data/drinks.csv")
drinks.head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
5,Antigua & Barbuda,102,128,45,4.9,NaN
6,Argentina,193,25,221,8.3,SA
7,Armenia,21,179,11,3.8,EU
8,Australia,261,72,212,10.4,OC
9,Austria,279,75,191,9.7,EU

### (max 0.5) Step 3.2. Print the mean alcoohol consumption per continent for every column

In [29]:
drinks.groupby("continent").mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

# For dealing with the following task the u.user!!!! dataset is required

In [33]:
users = pd.read_csv("./data/u.user", sep = "|")

users.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### (max 0.5) Step 3.3. For each combination of occupation and gender, calculate the mean age

In [40]:
# Не помню как удалить целую колонку
# поэтому здесь ah-hoc решение
users_updated = users[["age", "gender", "occupation"]]
users_updated.groupby(["occupation", "gender"]).mean()

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000
              M       29.000000
executive     F       44.000000
              M       38.172414
healthcare    F       39.818182
              M       45.400000
homemaker     F       34.166667
              M       23.000000
lawyer        F       39.500000
              M       36.200000
librarian     F       40.000000
              M       40.000000
marketing     F       37.200000
              M       37.875000
none          F       36.500000
              M       18.600000
other         F       35.472222
              M       34.028986
programmer    F       32.166667
              M       33.216667
retired       F       70.000000
              M       62.538462
salesman      F       27.000000
              M       38.555556
scientist     F       28.333333
              M       36.321429
student       F       20.750000
              M       22.669118
technician    F       38.000000
              M       32.961538
writer        F       37.631579
              M       35.346154

### (max 0.5) Step 3.4.  For each occupation present the percentage of women and men

In [49]:
gr = users.groupby(["occupation", "gender"])

gr?

### (max 0.5) Step 3.5. Discover the Male ratio per occupation and sort it from the most to the least

In [43]:
users.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

# (max 1.5) Part 4. Apply

### (max 0.5) Step 4.1. Assign dataset (!!! file US_Crime_Rates_1960_2014.csv is  used) to a variable called crime

In [101]:
crime = pd.read_csv("./data/US_Crime_Rates_1960_2014.csv")
crime.head(10)

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800
5,1965,193526000,4739400,387390,4352000,9960,23410,138690,215330,1282500,2572600,496900
6,1966,195576000,5223500,430180,4793300,11040,25820,157990,235330,1410100,2822000,561200
7,1967,197457000,5903400,499930,5403500,12240,27620,202910,257160,1632100,3111600,659800
8,1968,199399000,6720200,595010,6125200,13800,31670,262840,286700,1858900,3482700,783600
9,1969,201385000,7410900,661870,6749000,14760,37170,298850,311090,1981900,3888600,878500

### (max 0.5) Step 4.2. Convert the type of the column Year to datetime64

In [102]:
print(crime["Year"].head(1))
crime["Year"] = pd.to_datetime(crime["Year"], format = "%Y")
print(crime["Year"].head(1))

0    1960
Name: Year, dtype: int64
0   1960-01-01
Name: Year, dtype: datetime64[ns]

## (max 0.5) Step 4.3. Group the year by decades and sum the values

#### Pay attention to the Population column number, summing this column is a mistake

In [105]:
crime["Decades"] = crime["Year"].apply(lambda x: str(x)[:3] + "x")
crime.groupby("Decades").sum().head(10)

,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Decades,,,,,,,,,,,
196x,1915053175,49295900,4134930,45160900,106180,236720,1633510,2158520,13321100,26547700,5292100
197x,2121193298,100991600,9607930,91383800,192230,554570,4159020,4702120,28486000,53157800,9739900
198x,2371370069,131123369,14074328,117048900,206439,865639,5383109,7619130,33073494,72040253,11935411
199x,2612825258,136582146,17527048,119053499,211664,998827,5748930,10568963,26750015,77679366,14624418
200x,2947969117,115012044,13968056,100944369,163068,922499,4230366,8652124,21565176,67970291,11412834
201x,1570146307,50167967,6072017,44095950,72867,421059,1749809,3764142,10125170,30401698,3569080

# (max 2) Part 5. Merge

In [7]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### (max 0.5) Step 5.1. Create the 3 DataFrames based on the followin raw data

In [117]:
data_1 = pd.DataFrame(raw_data_1)
data_2 = pd.DataFrame(raw_data_2)
data_3 = pd.DataFrame(raw_data_3)

### (max 0.5) Step 5.2. Join the two dataframes along rows and assign all_data

In [137]:
print(len(data_1))
print(len(data_2))

all_data = data_1.append(data_2, ignore_index=True)
print(len(all_data))

all_data.head(10)

5
5
10

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
5          4      Billy    Bonder
6          5      Brian     Black
7          6       Bran   Balwner
8          7      Bryce     Brice
9          8      Betty    Btisan

### (max 0.5) Step 5.3. Merge only the data that has the same 'subject_id' on both data1 and data2

In [138]:
data_1.merge(data_2, left_on='subject_id', right_on='subject_id')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

### (max 0.5) Step 5.4. Merge all_data and data3 along the subject_id value

In [139]:
all_data.merge(data_3, left_on='subject_id', right_on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15